---
kind: property
id: P:Autodesk.Revit.DB.Visual.AdvancedWood.WoodDiffusePerlinProf
source: html/f60ee418-a6bb-5087-9a29-65aa15763260.htm
---
# Autodesk.Revit.DB.Visual.AdvancedWood.WoodDiffusePerlinProf Property

The property labeled "Profile for diffuse albedo perlin noise" from the "AdvancedWood" schema.

## Syntax (C#)
```csharp
public static string WoodDiffusePerlinProf { get; }
```

## Remarks
This property is of type "AssetPropertyDouble".